
## Plan Result




<pre><code>Plan: 1 to add, 3 to change, 0 to destroy.</code></pre>

* Create
  * module.redis-cache.azurerm_private_endpoint.this[0]
* Update
  * azurerm_key_vault_secret.redis_connection_string
  * module.redis-cache.azurerm_redis_cache.redis
  * module.redis-cache.azurerm_resource_group.cache-resourcegroup[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.redis_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "redis_connection_string" {
        id                      = "https://div-aat.vault.azure.net/secrets/dn-redis-connection-string/2903d41a42f5435caa1683f6b1749213"
        name                    = "dn-redis-connection-string"
      ~ tags                    = {
          - "file-encoding" = "utf-8" -> null
        }
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.redis-cache.azurerm_private_endpoint.this[0] will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "div-redis-aat"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "div-redis-cache-aat"
      + subnet_id                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/core-infra-subnet-2-aat"
      + tags                     = {
          + "BuiltFrom"           = "https://github.com/HMCTS/div-decree-nisi-frontend.git"
          + "application"         = "divorce"
          + "businessArea"        = "CFT"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#div-dev"
          + "environment"         = "staging"
          + "managedBy"           = "Divorce"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "redis-endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "div-redis-aat"
          + private_connection_resource_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-redis-cache-aat/providers/Microsoft.Cache/Redis/div-redis-aat"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "redisCache",
            ]
        }
    }

  # module.redis-cache.azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-redis-cache-aat/providers/Microsoft.Cache/Redis/div-redis-aat"
        name                          = "div-redis-aat"
      ~ tags                          = {
          ~ "BuiltFrom"           = "https://github.com/HMCTS/div-decree-absolute-frontend.git" -> "https://github.com/HMCTS/div-decree-nisi-frontend.git"
            # (6 unchanged elements hidden)
        }
        # (21 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.redis-cache.azurerm_resource_group.cache-resourcegroup[0] will be updated in-place
  # (moved from module.redis-cache.azurerm_resource_group.cache-resourcegroup)
  ~ resource "azurerm_resource_group" "cache-resourcegroup" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-redis-cache-aat"
        name     = "div-redis-cache-aat"
      ~ tags     = {
          ~ "BuiltFrom"           = "https://github.com/HMCTS/div-decree-absolute-frontend.git" -> "https://github.com/HMCTS/div-decree-nisi-frontend.git"
            # (6 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 3 to change, 0 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.redis-cache.azurerm_redis_cache.redis has changed
  ~ resource "azurerm_redis_cache" "redis" {
        id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-redis-cache-aat/providers/Microsoft.Cache/Redis/div-redis-aat"
        name                          = "div-redis-aat"
      ~ primary_access_key            = (sensitive value)
        tags                          = {
            "BuiltFrom"           = "https://github.com/HMCTS/div-decree-nisi-frontend.git"
            "application"         = "divorce"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#div-dev"
            "environment"         = "staging"
            "managedBy"           = "Divorce"
        }
        # (22 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":695,"Program":"tfcmt","SHA1":"","Vars":{}} -->